In [6]:
%load_ext autoreload
%autoreload 2
%reload_ext autoreload
import os 
from db_process import DB_Process
import json
from tqdm import tqdm
import pandas as pd

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [7]:
df = pd.read_csv('college_football_players.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26298 entries, 0 to 26297
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   full_school_name  26298 non-null  object
 1   school_name       26298 non-null  object
 2   player_name       26298 non-null  object
 3   position          26298 non-null  object
 4   height            26298 non-null  float64
 5   weight            26298 non-null  float64
 6   year              26298 non-null  object
 7   hometown          26298 non-null  object
 8   state             26298 non-null  object
 9   id                26298 non-null  int64
dtypes: float64(2), int64(1), object(7)
memory usage: 2.0+ MB

In [34]:
df.describe()

             height        weight            id
count  26298.000000  26298.000000  26298.000000
mean      72.676782    222.952126  13149.500000
std        7.069058     47.378910   7591.723026
min        0.000000      0.000000      1.000000
25%       71.000000    190.000000   6575.250000
50%       73.000000    215.000000  13149.500000
75%       75.000000    253.000000  19723.750000
max       83.000000    401.000000  26298.000000

In [30]:
column_names = tuple(df.columns.values.tolist())
column_names

('full_school_name',
 'school_name',
 'player_name',
 'position',
 'height',
 'weight',
 'year',
 'hometown',
 'state',
 'id')

In [8]:
my_db = DB_Process()

In [ ]:
table_dict = (
    {
        "table_name": "college_football_players",
        "column_name": column_names,
        "column_type": (
            "VARCHAR",
            "VARCHAR",
            "VARCHAR",
            "VARCHAR",
            "FLOAT4",
            "FLOAT4",
            "VARCHAR",
            "VARCHAR",
            "VARCHAR",
            "INT2 PRIMARY KEY",
        ),
    },
)
my_db.create_tables(table_dict)

2025-03-26 00:39 - ERROR - Error in create_tables(): relation "college_football_players" already exists

In [32]:
for row in df.iterrows():
    row = row[1].values
    print(tuple(row))
    break

('Cincinnati Bearcats', 'Cincinnati', 'Ralph Abernathy', 'RB', 67.0, 161.0, 'JR', 'ATLANTA, GA', 'GA', 1)

In [33]:
for row in df.iterrows():
   row = row[1].values
   table_values = {'table_name': 'college_football_players',
               'column_name': column_names,
               'column_value': tuple(row)
               }
   my_db.insert_table(table_values)